<a href="https://colab.research.google.com/github/sureshmecad/Samrat-Ashok-Technology-Internship/blob/main/Day69_Pandas_Cleaning_Data_of_Wrong_Format.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### **PANDAS-Cleaning Data of wrong format**

- Cells with data of wrong format can make it difficult or even impossible to analyze data.

- To fix it, we have two options: removes the rows or convert all cells in the columns into the same format.

- Convert into a correct format: In our dataframe, we have two cells with the wrong format check out row 3 & 4, the 'Date' column should be a string that represents a date.

- Lets try to convert all cells in the **'Date'** column into dates. Pandas has a **to_datetime()** method for this.

In [5]:
import pandas as pd
import numpy as np

In [6]:
# convert to date
df = pd.DataFrame({'Name': ['Nirmal', 'Priyanka', 'Resham', 'Jalaj'],
                   'Date': ['2021/07/31', '2021/08/01', np.nan, '20210802'],
                   'Age': [35, 33, 3, 400]})

df

       Name        Date  Age
0    Nirmal  2021/07/31   35
1  Priyanka  2021/08/01   33
2    Resham         NaN    3
3     Jalaj    20210802  400

In [7]:
df['Date'] = pd.to_datetime(df['Date'])
print(df.to_string())

       Name       Date  Age
0    Nirmal 2021-07-31   35
1  Priyanka 2021-08-01   33
2    Resham        NaT    3
3     Jalaj 2021-08-02  400

- As we can see from the result, the date in row 4 where fixed, but empty date in row 3 got a **NaT(Not a time)** value, in other words an empty value. One way to deal with empty values is simply removing the entire row.

#### **Removing Rows:**

- The result from the converting in the example above gave us a **NaT value**, which can be handled as a **NULL** value, and we can remove the row by using the **dropna()** method.

- The **df.dropna(subset=['Date'], inplace=True)**

In [8]:
# remove rows with a NULL value in the 'Date' column
df['Date'] = pd.to_datetime(df['Date'])
df.dropna(subset=['Date'], inplace=True)
print(df.to_string())

       Name       Date  Age
0    Nirmal 2021-07-31   35
1  Priyanka 2021-08-01   33
3     Jalaj 2021-08-02  400

#### **Fixing Wrong data**

- **"Wrong data"** does not have to be **"empty cells" or "wrong format"**, it can just be wrong, like if someone **registered "199" instead of "1.99".**

- sometimes we can spot wrong data by looking at the dataset, because you have an expectation of what it should be.

- If we take a look at our dataset, you can see that in **row 4, the age is 400**.

- How can we fix wrong values, like the one for "Age" in row 4?

#### **Replacing Values**

- One way to **fix wrong values** is to **replace them with something else**.

- In our example, it is most likely a **typo**, and the value should be **"4" instead of "400"**, and we could just **insert "4" in row 4.**

set **"Age" = 4 in row 4**

**df.loc[4, 'Age'] = 4**

In [9]:
df['Date'] = pd.to_datetime(df['Date'])
df.dropna(subset=['Date'], inplace=True)
df.loc[3, 'Age'] = 4
print(df.to_string())

       Name       Date  Age
0    Nirmal 2021-07-31   35
1  Priyanka 2021-08-01   33
3     Jalaj 2021-08-02    4

- For small datasets we might be able to replace the wrong data one by one, but not for big datasets.

- To replace wrong data for larger datasets you can create some rules e.g. set some boundaries for legal values, and replace any values that are outside of the boundaries.

In [10]:
# Loop through all values in the 'Duration' column
# if the value is higher than 100, set it to 4:

df['Date'] = pd.to_datetime(df['Date'])
df.dropna(subset=['Date'], inplace=True)

for x in df.index:
  if df.loc[x, "Age"] > 100:
    df.loc[x, "Age"] = 4

print(df.to_string())

       Name       Date  Age
0    Nirmal 2021-07-31   35
1  Priyanka 2021-08-01   33
3     Jalaj 2021-08-02    4

#### **Removing rows**

- Another way of handling wrong data is to remove the row that contains wrong data.

- This way we do not have to find out what to replace them with and there is a good chance you do not need them to do your analyses.

In [11]:
# Delete rows where "Age" is higher than 100
df['Date'] = pd.to_datetime(df['Date'])
df.dropna(subset=['Date'], inplace=True)

for x in df.index:
  if df.loc[x, "Age"] > 100:
    df.drop(x, inplace=True)

print(df.to_string())

       Name       Date  Age
0    Nirmal 2021-07-31   35
1  Priyanka 2021-08-01   33
3     Jalaj 2021-08-02    4

#### **Reference**

- https://www.youtube.com/watch?v=TOp-0xfqgeA&list=PLzx-_kRo3HZtP3tWaieUPwAh9K4I00_6p&index=43